namespace stuff
{
    public class Lesson
    {
        /*Создайте симуляцию зоопарка, включающую различные виды животных. Зоопарк должен иметь возможность добавлять новых животных, кормить их и отображать информацию о них.

            Задачи:
        1. Определите базовый класс Animal:
        - Атрибуты: имя, возраст, вид и тип пищи (плотоядное, травоядное, всеядное животное).
        - Методы: eat() (который должен выводить, что ест животное), sleep() (выводит, что животное спит) и make_sound() (у каждого животного будет уникальный звук).

        2. Наследование - Создание наследников класса Animal:
        - Млекопитающее, Птица, рептилия: они должны наследоваться от Animal и могут иметь дополнительные атрибуты, уникальные для каждой категории, например WingSpan для птицы и IsVenomous для рептилии.


        3. Класс Zoo:
        - Должен содержать список животных.
        - Методы: AddAnimal() (для добавления нового животного в зоопарк), FeedAnimals() (который заставляет каждое животное есть) и PrintAllAnimals() (который выводит список всех животных по названию и видам).


        4. Тестирование:
        - Создайте экземпляр класса Zoo.
        - Заполните его различными млекопитающими, птицами и рептилиями.
        - Вызовите PrintAllAnimals(), FeedAnimals() и заставьте каждое животное издавать звук().


        5. Важное
        Внимательно продумайте вашу систему. Пользуйтесь принципом инкапсуляции. Добавление дополнительного функционала - приветствуется)

        Задание сдается не в виде полного листинга кода! Отправляйте только файл, где демонстрируется работа программы и класса Zoo. 
        На скриншоте должны быть видны классы, созданные вами(по умолчанию в Visual Studio - справа, в Rider - слева)*/

    }


}